 const markets = {
  // no need format
  "上海": ["上海"],
  "深圳": [ "深圳", "儋州", "三亚", "琼海", "珠海", "钦州", "梧州", "万宁", "柳州", "海口", "南宁", "玉林", "桂林", "北海", "澄迈县", "百色", "贵港", "贺州", "来宾", "文昌", "东方", "防城港", "河池", "陵水", "昌江", "定安县", "乐东", "临高县", "屯昌县", ],
  "北京": ["北京"],
  "广州": [ "广州", "佛山", "湛江", "惠州", "东莞", "茂名", "阳江", "中山", "江门", "清远", "肇庆", "韶关", "河源", "梅州", "汕尾", "云浮", ],
  "南京": [ "南京", "合肥", "宿州", "黄山", "池州", "常州", "马鞍山", "徐州", "六安", "扬州", "芜湖", "淮安", "连云港", "铜陵", "淮南", "淮北", "安庆", "阜阳", "蚌埠", "宿迁", "滁州", "宣城", "亳州", ],
  "无锡": ["无锡", "镇江", "泰州"],
  "苏州": ["苏州", "南通", "盐城"],
  "杭州": [ "杭州", "宁波", "嘉兴", "温州",  "绍兴", "金华", "台州", "舟山", "湖州", "丽水", "衢州", ],
  "天津": [ "天津", "石家庄", "唐山", "张家口", "邢台", "呼和浩特", "保定", "秦皇岛", "包头", "邯郸", "廊坊", "承德", "赤峰", "沧州", "衡水", "克拉玛依", "乌鲁木齐", "巴彦淖尔", "乌海", "鄂尔多斯", "乌兰察布", "石河子", "昌吉", "锡林郭勒盟", "伊犁", "阿克苏", "阿拉善盟", "巴音郭楞", "博尔塔拉", "哈密", "喀什", "吐鲁番", "和田", ],
  "成都": [ "成都", "大理", "昆明", "绵阳", "南充", "玉溪", "曲靖", "六盘水", "重庆", "贵阳", "保山", "宜宾", "泸州", "丽江", "攀枝花", "自贡", "德阳", "眉山", "安顺", "雅安", "拉萨", "遂宁", "昭通", "遵义", "达州", "资阳", "文山", "内江", "广安", "普洱", "广元", "临沧", "乐山", "毕节", "德宏", "迪庆", "红河", "凉山", "黔南", "铜仁", "西双版纳", "林芝", "甘孜", "山南", "巴中", "楚雄", ],
  "沈阳": [ "沈阳", "鞍山", "长春", "大连", "丹东", "吉林", "通辽", "盘锦", "葫芦岛", "锦州", "营口", "辽阳", "辽源", "松原", "抚顺", "四平", "阜新", "本溪", "朝阳", "铁岭", "延边", "白城", "通化", "白山", "兴安盟", ],
  "太原": [ "太原", "榆林", "西安", "兰州", "延安", "长治", "大同", "晋中", "临汾", "银川", "西宁", "天水", "咸阳", "石嘴山", "宝鸡", "渭南", "运城", "阳泉", "嘉峪关", "定西", "晋城", "忻州", "吕梁", "张掖", "金昌", "平凉", "铜川", "朔州", "汉中", "安康", "武威", "酒泉", "白银", "庆阳", "商洛", "海西", "吴忠", ],
  "武汉": [ "武汉", "南昌", "襄阳", "仙桃", "荆州", "上饶", "宜昌", "十堰", "九江", "黄石", "萍乡", "新余", "吉安", "孝感", "景德镇", "黄冈", "随州", "抚州", "天门", "鹰潭", "宜春", "赣州", "潜江", "鄂州", "恩施", "荆门", "咸宁", ],
  "长沙": [ "张家界", "益阳", "长沙", "衡阳", "常德", "株洲", "娄底", "郴州", "邵阳", "永州", "怀化", "湘西", "湘潭", "岳阳", ],
  "福州": [ "宁德", "厦门", "汕头", "揭阳", "福州", "泉州", "莆田", "潮州", "龙岩", "南平", "漳州", "三明", ],
  "哈尔滨": [ "哈尔滨", "齐齐哈尔", "牡丹江", "大庆", "佳木斯", "绥化", "鸡西", "呼伦贝尔", "伊春", "黑河", "七台河", "鹤岗", "双鸭山", "大兴安岭", ],
  "郑州": [ "郑州", "洛阳", "濮阳", "开封", "平顶山", "驻马店", "南阳", "新乡", "商丘", "焦作", "安阳", "信阳", "许昌", "漯河", "三门峡", "周口", "鹤壁", "济源", ],
  "济南": [ "济南", "青岛", "威海", "东营", "烟台", "潍坊", "淄博", "临沂", "聊城", "泰安", "济宁", "日照", "菏泽", "滨州", "德州", "枣庄", "莱芜", ],
};

module.exports = markets
